%作损伤指标柱状图
clear;clc;

fixOption=0;    %是否修正损伤指标柱状图
                %0表示不修正，1表示修正
barXlabel='单元编号';   %x轴名称
barYlabel='损伤指标';   %y轴名称

tickFontName='Times New Roman';
tickFontSize=12;
xlabelFontName='仿宋';
ylabelFontName='仿宋';
xlabelFontSize=12;
ylabelFontSize=12;

beta=[-0.008012558
-0.007878911
-0.007670954
-0.00753499
-0.007999841
-0.008307448
-0.007587892
-0.007671972
-0.007805288
-0.007876129
-0.007360412
-0.007559304
-0.00738341
-0.007192524
-0.006822265
-0.006638796
-0.006679451
-0.006470357
-0.006251883
-0.006017184
-0.005760893
-0.005470016
-0.005007957
-0.004059283
-0.004305169
-0.003377058
-0.003024511
-0.001464266
0.000170419
0.002586726
0.006362679
0.013220307
0.030608449
0.068941568
-0.059828061
-0.033682813
-0.025056141
-0.021332613
-0.018722508
-0.01763527
-0.016053906
-0.014111205
-0.013781817
-0.013998969
-0.013250981
-0.013027068
-0.012657361
-0.012439696
-0.012113459
-0.012162549
0.431375708
-0.012162549
-0.012113459
-0.012439696
-0.012657361
-0.013027068
-0.013250981
-0.013998969
-0.013781817
-0.014111205
-0.016053906
-0.01763527
-0.018722508
-0.021332613
-0.025056141
-0.033682813
-0.059828061
0.068941568
0.030608449
0.013220307
0.006362679
0.002586726
0.000170419
-0.001464266
-0.003024511
-0.003377058
-0.004305169
-0.004059283
-0.005007957
-0.005470016
-0.005760893
-0.006017184
-0.006251883
-0.006470357
-0.006679451
-0.006638796
-0.006822265
-0.007192524
-0.00738341
-0.007559304
-0.007360412
-0.007876129
-0.007805288
-0.007671972
-0.007587892
-0.008307448
-0.007999841
-0.00753499
-0.007670954
-0.007878911
-0.008012558
];  %各单元beta
barWidth=0.2;
barData=beta;
if fixOption~=0
    fixbeta=beta-min(beta);
    barData=fixbeta;
end

bar(barData,barWidth);  

legendTitle='beta';

for i=1:size(beta,1)
    xTickLabel{i}=num2str(i);
end

xTickScaleLimit=30;
if size(beta,1)>xTickScaleLimit
    for i=2:size(beta,1)
        if mod(i-1,10)~=0
            xTickLabel{i}=' ';
        end
    end
end

xlim([0 size(beta,1)]);    
xTick=1:size(beta,1);
set(gca,'ticklength',[0 0]);    %设置x,y轴的刻度长度为0
set(gca,'FontName',tickFontName,'xtick',xTick,'XTickLabel',xTickLabel,'FontSize',tickFontSize); %设置x轴所代表大时间

xlabel(barXlabel,'FontName',xlabelFontName,'FontSize',xlabelFontSize); %设置x轴和y轴的名称
ylabel(barYlabel,'FontName',ylabelFontName,'FontSize',ylabelFontSize); 

legend(legendTitle); %区分一下蓝色和红色分别代表什么
legend('hide');
%legend('show');